app/views/players/_form.html.erb

  <br>
  <%= f.collection_check_boxes :team_ids, Team.all, :id, :name %>
---
SELECT "teams".* FROM "teams"