app/views/players/show.html.erb

<div class="competition-box-index">
  <h4>Team: <% if @player.teams.length == 0 %>
---
SELECT "teams".* FROM "teams" INNER JOIN "squads" ON "teams"."id" = "squads"."team_id" WHERE "squads"."player_id" = ?  [["player_id", 121]]