app/controllers/players_controller.rb

INSERT INTO "players" ("name", "dob", "gender", "goalkeeper_skill", "defender_skill", "midfielder_skill", "striker_skill", "height_cm", "weight_kg", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "players".* FROM "players" ORDER BY "players"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "squads" ("team_id", "player_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["team_id", 3], ["player_id", 120], ["created_at", "2019-05-28 20:30:11.887028"], ["updated_at", "2019-05-28 20:30:11.887028"]]
---
  def create
    @player = Player.new(player_params)
    if @player.valid?
      @player.save

      if params[:player][:team_ids].length > 1
        team_ids = params[:player][:team_ids].slice(1..params[:player][:team_ids].length)
        team_ids.each do |team_id|
          Squad.create(player_id: @player.id, team_id: team_id.to_i)

UPDATE "players" SET "gender" = ?, "goalkeeper_skill" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["gender", "Male"], ["goalkeeper_skill", 76], ["updated_at", "2019-05-28 20:43:22.307897"], ["id", 1]]
---
  def update
    @player.update player_params

SELECT "teams".* FROM "teams" INNER JOIN "squads" ON "teams"."id" = "squads"."team_id" WHERE "squads"."player_id" = ?  [["player_id", 121]]
SELECT "squads".* FROM "squads" WHERE "squads"."player_id" = ?  [["player_id", 121]]
DELETE FROM "squads" WHERE "squads"."id" = ?  [["id", 83]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 121]]
---
  def destroy
    if @player.teams.length > 0
      @player.squads.each do |squad|
        squad.destroy
      end
    else
      @player.destroy

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 121], ["LIMIT", 1]]
---
  def find_player
    @player = Player.find(params[:id])